In [1]:
import pymysql
import pandas as pd

In [2]:
from sqlalchemy import create_engine

In [3]:
import getpass
password = getpass.getpass()

········

In [4]:
connection_string = "mysql+pymysql://root:" + password + "@localhost/bank"

engine = create_engine(connection_string)

Check the number of rentals for each customer for May

In [5]:
rentals_may = pd.read_sql("SELECT customer_id, count(*) FROM sakila.rentals_may GROUP BY customer_id",engine)

In [6]:
rentals_may

     customer_id  count(*)
0            130         2
1            459         1
2            408         3
3            333         1
4            222         5
..           ...       ...
515          191         2
516          351         1
517           10         1
518          136         1
519           61         1

[520 rows x 2 columns]

In [7]:
rentals_june = pd.read_sql("SELECT customer_id, count(*) FROM sakila.rentals_june GROUP BY customer_id", engine)

In [8]:
rentals_june

     customer_id  count(*)
0            416         5
1            516         6
2            239         5
3            285         3
4            310         6
..           ...       ...
585          412         1
586          335         1
587          226         2
588           22         1
589          126         1

[590 rows x 2 columns]

Write a function that checks if customer borrowed more or less books in the month of June as compared to May.

In [9]:
compare = pd.merge(rentals_may, rentals_june , on='customer_id',suffixes=('rentals_may','rentals_june'))

In [12]:
compare

     customer_id  count(*)rentals_may  count(*)rentals_june
0            130                    2                     6
1            459                    1                     7
2            408                    3                     3
3            333                    1                     4
4            222                    5                     2
..           ...                  ...                   ...
507          431                    1                     7
508          191                    2                     6
509          351                    1                     3
510           10                    1                     5
511          136                    1                     1

[512 rows x 3 columns]





def compare_ms():
    
    for customer in compare['customer_id']:
        return compare['count(*)rentals_may'] > compare['count(*)rentals_june']    
            compare['Month with most rentals'] = 'May'
        elif compare['count(*)rentals_may'] == compare['count(*)rentals_june']:
             compare['Month with most rentals'] = 'Equal'    
        else: 
            compare['Month with most rentals'] = 'June'

In [13]:
compare['count(*)rentals_may'] > compare['count(*)rentals_june']

0      False
1      False
2      False
3      False
4       True
       ...
507    False
508    False
509    False
510    False
511    False
Length: 512, dtype: bool